app/controllers/songs_controller.rb

INSERT INTO "artists" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", ".38 Special"], ["created_at", "2019-02-23 16:26:06.511734"], ["updated_at", "2019-02-23 16:26:06.511734"]]
INSERT INTO "songs" ("title", "created_at", "updated_at", "artist_id") VALUES (?, ?, ?, ?)  [["title", "Caught Up in You"], ["created_at", "2019-02-23 16:26:06.513103"], ["updated_at", "2019-02-23 16:26:06.513103"], ["artist_id", 138]]
---
  def upload
     CSV.foreach(params["file"].path, headers: true) do |song|
       Song.create(title: song[0], artist_name: song[1])